/**
 * Marlin 3D Printer Firmware
 * Copyright (c) 2020 MarlinFirmware [https://github.com/MarlinFirmware/Marlin]
 *
 * Based on Sprinter and grbl.
 * Copyright (c) 2011 Camiel Gubbels / Erik van der Zalm
 *
 * This program is free software: you can redistribute it and/or modify
 * it under the terms of the GNU General Public License as published by
 * the Free Software Foundation, either version 3 of the License, or
 * (at your option) any later version.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with this program.  If not, see <https://www.gnu.org/licenses/>.
 *
 */

#pragma once

// OVERVIEW OF PREPROCESSOR DEFINITIONS:
// __AVR_ATmega2560__
// __AVR_ATmega1284P__
// __AVR_ATmega1280__
// __AVR_ATmega644__
// __AVR_ATmega644P__
// __AVR_ATmega2561__

// ATmega2560 technical reference manual date: 28th of November, 2022

// As old as the ATmega series of CPU is, the worse the actual libraries making
// use of the MCU likely are.

// These registers as references do not take program space since they are purely references.

// Adding 0x20 to the memory location of registers is a retarded idea.
// See page 403 of ATmega2560 documentation, Note 4.

struct _bit_reg_t {
  uint8_t val;

  bool getValue(uint8_t idx) {
    return ( val & (1<<idx) );
  }
  void setValue(uint8_t idx, bool value) {
    if (value)
      val |= (1<<idx);
    else
      val &= ~(1<<idx);
  }
};
typedef _bit_reg_t PIN_reg_t;
typedef _bit_reg_t DDR_reg_t;
typedef _bit_reg_t PORT_reg_t;

struct PORT_dev_t {
  PIN_reg_t _PIN;
  DDR_reg_t _DDR;
  PORT_reg_t _PORT;
};
static_assert(sizeof(PORT_dev_t) == 3, "invalid size of ATmega2560 GPIO_dev_t");

struct _bitG_reg_t {
  uint8_t val : 6;
  uint8_t reserved1 : 2;
  
  bool getValue(uint8_t idx) {
    return ( val & (1<<idx) );
  }
  void setValue(uint8_t idx, bool value) {
    if (value)
      val |= (1<<idx);
    else
      val &= ~(1<<idx);
  }
};
typedef _bitG_reg_t PING_reg_t;
typedef _bitG_reg_t DDRG_reg_t;
typedef _bitG_reg_t PORTG_reg_t;

struct PORTG_dev_t {
  PING_reg_t _PIN;
  DDRG_reg_t _DDR;
  PORTG_reg_t _PORT;
};

struct TIFR0_reg_t {
  uint8_t _TOV0 : 1;
  uint8_t _OCF0A : 1;
  uint8_t _OCF0B : 1;
  uint8_t reserved1 : 5;
};
static_assert(sizeof(TIFR0_reg_t) == 1, "invalid size of ATmega2560 TIFR0_reg_t");

struct TIFR1_reg_t {
  uint8_t _TOV1 : 1;
  uint8_t _OCF1A : 1;
  uint8_t _OCF1B : 1;
  uint8_t _OCF1C : 1;
  uint8_t reserved1 : 1;
  uint8_t _ICF1 : 1;
  uint8_t reserved2 : 2;
};
static_assert(sizeof(TIFR1_reg_t) == 1, "invalid size of ATmega2560 TIFR1_reg_t");

struct TIFR2_reg_t {
  uint8_t _TOV2 : 1;
  uint8_t _OCF2A : 1;
  uint8_t _OCF2B : 1;
  uint8_t reserved1 : 5;
};
static_assert(sizeof(TIFR2_reg_t) == 1, "invalid size of ATmega2560 TIFR2_reg_t");

struct TIFR3_reg_t {
  uint8_t _TOV3 : 1;
  uint8_t _OCF3A : 1;
  uint8_t _OCF3B : 1;
  uint8_t _OCF3C : 1;
  uint8_t reserved1 : 1;
  uint8_t _ICF3 : 1;
  uint8_t reserved2 : 2;
};
static_assert(sizeof(TIFR3_reg_t) == 1, "invalid size of ATmega2560 TIFR3_reg_t");

struct TIFR4_reg_t {
  uint8_t _TOV4 : 1;
  uint8_t _OCF4A : 1;
  uint8_t _OCF4B : 1;
  uint8_t _OCF4C : 1;
  uint8_t reserved1 : 1;
  uint8_t _ICF4 : 1;
  uint8_t reserved2 : 2;
};
static_assert(sizeof(TIFR4_reg_t) == 1, "invalid size of ATmega2560 TIFR4_reg_t");

struct TIFR5_reg_t {
  uint8_t _TOV5 : 1;
  uint8_t _OCF5A : 1;
  uint8_t _OCF5B : 1;
  uint8_t _OCF5C : 1;
  uint8_t reserved1 : 1;
  uint8_t _ICF5 : 1;
  uint8_t reserved2 : 2;
};
static_assert(sizeof(TIFR5_reg_t) == 1, "invalid size of ATmega2560 TIFR5_reg_t");

struct PCIFR_reg_t {
  uint8_t _PCIF0 : 1;
  uint8_t _PCIF1 : 1;
  uint8_t _PCIF2 : 1;
  uint8_t reserved1 : 5;
};
static_assert(sizeof(PCIFR_reg_t) == 1, "invalid size of PCIFR_reg_t");

struct EECR_reg_t {
  uint8_t _EERE : 1;
  uint8_t _EEPE : 1;
  uint8_t _EEMPE : 1;
  uint8_t _EERIE : 1;
  uint8_t _EEPM0 : 1;
  uint8_t _EEPM1 : 1;
  uint8_t reserved1 : 2;
};
static_assert(sizeof(EECR_reg_t) == 1, "invalid size of ATmega2560 EECR_reg_t");

struct EEAR_reg_t {
  uint16_t _EEAR : 12;
  uint16_t reserved1 : 4;
};
static_assert(sizeof(EEAR_reg_t) == 2, "invalid size of ATmega2560 EEAR_reg_t");

struct GTCCR_reg_t {
  uint8_t _PSRSYNC : 1;
  uint8_t _PSRASY : 1;
  uint8_t reserved1 : 5;
  uint8_t _TSM : 1;
};
static_assert(sizeof(GTCCR_reg_t) == 1, "invalid size of ATmega2560 GTCCR_reg_t");

struct TCCR0A_reg_t {
  uint8_t _WGM00 : 1;
  uint8_t _WGM01 : 1;
  uint8_t reserved1 : 2;
  uint8_t _COM0B : 2;
  uint8_t _COM0A : 2;
};
static_assert(sizeof(TCCR0A_reg_t) == 1, "invalid size of ATmega2560 TCCR0A_reg_t");

struct TCCR0B_reg_t {
  uint8_t _CS0 : 3;
  uint8_t _WGM02 : 1;
  uint8_t reserved1 : 2;
  uint8_t _FOC0B : 1;
  uint8_t _FOC0A : 1;
};
static_assert(sizeof(TCCR0B_reg_t) == 1, "invalid size of ATmega2560 TCCR0B_reg_t");

struct SPCR_reg_t {
  uint8_t _SPR : 2;
  uint8_t _CPHA : 1;
  uint8_t _CPOL : 1;
  uint8_t _MSTR : 1;
  uint8_t _DORD : 1;
  uint8_t _SPE : 1;
  uint8_t _SPIE : 1;
};
static_assert(sizeof(SPCR_reg_t) == 1, "invalid size of ATmega2560 SPCR_reg_t");

struct SPSR_reg_t {
  uint8_t _SPI2X : 1;
  uint8_t reserved1 : 5;
  uint8_t _WCOL : 1;
  uint8_t _SPIF : 1;
};
static_assert(sizeof(SPSR_reg_t) == 1, "invalid size of ATmega2560 SPSR_reg_t");

struct ACSR_reg_t {
  uint8_t _ACIS : 2;
  uint8_t _ACIC : 1;
  uint8_t _ACIE : 1;
  uint8_t _ACI : 1;
  uint8_t _ACO : 1;
  uint8_t _ACBG : 1;
  uint8_t _ACD : 1;
};
static_assert(sizeof(ACSR_reg_t) == 1, "invalid size of ATmega2560 ACSR_reg_t");

struct SMCR_reg_t {
  uint8_t _SE : 1;
  uint8_t _SM : 3;
  uint8_t reserved1 : 4;
};
static_assert(sizeof(SMCR_reg_t) == 1, "invalid size of ATmega2560 SMCR_reg_t");

struct MCUSR_reg_t {
  uint8_t _PORF : 1;
  uint8_t _EXTRF : 1;
  uint8_t _BORF : 1;
  uint8_t _WDRF : 1;
  uint8_t _JTRF : 1;
  uint8_t reserved1 : 3;
};
static_assert(sizeof(MCUSR_reg_t) == 1, "invalid size of ATmega2560 MCUSR_reg_t");

struct MCUCR_reg_t {
  uint8_t _IVCE : 1;
  uint8_t _IVSEL : 1;
  uint8_t reserved1 : 2;
  uint8_t _PUD : 1;
  uint8_t reserved2 : 2;
  uint8_t _JTD : 1;
};
static_assert(sizeof(MCUCR_reg_t) == 1, "invalid size of ATmega2560 MCUCR_reg_t");

struct SPMCSR_reg_t {
  uint8_t _SPMEN : 1;
  uint8_t _PGERS : 1;
  uint8_t _PGWRT : 1;
  uint8_t _BLBSET : 1;
  uint8_t _RWWSRE : 1;
  uint8_t _SIGRD : 1;
  uint8_t _RWWSB : 1;
  uint8_t _SPMIE : 1;
};
static_assert(sizeof(SPMCSR_reg_t) == 1, "invalid size of ATmega2560 SPMCSR_reg_t");

struct RAMPZ_reg_t {
  uint8_t _RAMPZ : 2;
  uint8_t reserved1 : 6;
};
static_assert(sizeof(RAMPZ_reg_t) == 1, "invalid size of ATmega2560 RAMPZ_reg_t");

struct EIND_reg_t {
  uint8_t _EIND0 : 1;
  uint8_t reserved1 : 7;
};
static_assert(sizeof(EIND_reg_t) == 1, "invalid size of ATmega2560 EIND_reg_t");

struct SREG_reg_t {
  uint8_t _C : 1;
  uint8_t _Z : 1;
  uint8_t _N : 1;
  uint8_t _V : 1;
  uint8_t _S : 1;
  uint8_t _H : 1;
  uint8_t _T : 1;
  uint8_t _I : 1;
};
static_assert(sizeof(SREG_reg_t) == 1, "invalid size of ATmega2560 SREG_reg_t");

struct WDTCSR_reg_t {
  uint8_t _WDP0 : 1;
  uint8_t _WDP1 : 1;
  uint8_t _WDP2 : 1;
  uint8_t _WDE : 1;
  uint8_t _WDCE : 1;
  uint8_t _WDP3 : 1;
  uint8_t _WDIE : 1;
  uint8_t _WDIF : 1;
};
static_assert(sizeof(WDTCSR_reg_t) == 1, "invalid size of ATmega2560 WDTCSR_reg_t");

struct CLKPR_reg_t {
  uint8_t _CLKPS : 4;
  uint8_t reserved1 : 3;
  uint8_t _CLKPCE : 1;
};
static_assert(sizeof(CLKPR_reg_t) == 1, "invalid size of ATmega2560 CLKPR_reg_t");

struct PRR0_reg_t {
  uint8_t _PRADC : 1;
  uint8_t _PRUSART0 : 1;
  uint8_t _PRSPI : 1;
  uint8_t _PRTIM1 : 1;
  uint8_t reserved1 : 1;
  uint8_t _PRTIM0 : 1;
  uint8_t _PRTIM2 : 1;
  uint8_t _PRTWI : 1;
};
static_assert(sizeof(PRR0_reg_t) == 1, "invalid size of ATmega2560 PRR0_reg_t");

struct PRR1_reg_t {
  uint8_t _PRUSART1 : 1;
  uint8_t _PRUSART2 : 1;
  uint8_t _PRUSART3 : 1;
  uint8_t _PRTIM3 : 1;
  uint8_t _PRTIM4 : 1;
  uint8_t _PRTIM5 : 1;
  uint8_t reserved1 : 2;
};
static_assert(sizeof(PRR1_reg_t) == 1, "invalid size of ATmega2560 PRR1_reg_t");

struct PCICR_reg_t {
  uint8_t _PCIE0 : 1;
  uint8_t _PCIE1 : 1;
  uint8_t _PCIE2 : 1;
  uint8_t reserved1 : 5;
};
static_assert(sizeof(PCICR_reg_t) == 1, "invalid size of ATmega2560 PCICR_reg_t");

struct EICRA_reg_t {
  uint8_t _ISC0 : 2;
  uint8_t _ISC1 : 2;
  uint8_t _ISC2 : 2;
  uint8_t _ISC3 : 2;
};
static_assert(sizeof(EICRA_reg_t) == 1, "invalid size of ATmega2560 EICRA_reg_t");

struct EICRB_reg_t {
  uint8_t _ISC4 : 2;
  uint8_t _ISC5 : 2;
  uint8_t _ISC6 : 2;
  uint8_t _ISC7 : 2;
};
static_assert(sizeof(EICRB_reg_t) == 1, "invalid size of ATmega2560 EICRB_reg_t");

struct TIMSK0_reg_t {
  uint8_t _TOIE0 : 1;
  uint8_t _OCIE0A : 1;
  uint8_t _OCIE0B : 1;
  uint8_t _OCIE0C : 1;
  uint8_t reserved1 : 1;
  uint8_t _ICIE0 : 1;
  uint8_t reserved2 : 2;
};
static_assert(sizeof(TIMSK0_reg_t) == 1, "invalid size of ATmega2560 TIMSK0_reg_t");

struct TIMSK1_reg_t {
  uint8_t _TOIE1 : 1;
  uint8_t _OCIE1A : 1;
  uint8_t _OCIE1B : 1;
  uint8_t _OCIE1C : 1;
  uint8_t reserved1 : 1;
  uint8_t _ICIE1: 1;
  uint8_t reserved2 : 2;
};
static_assert(sizeof(TIMSK1_reg_t) == 1, "invalid size of ATmega2560 TIMSK1_reg_t");

struct TIMSK2_reg_t {
  uint8_t _TOIE2 : 1;
  uint8_t _OCIE2A : 1;
  uint8_t _OCIE2B : 1;
  uint8_t reserved1 : 5;
};
static_assert(sizeof(TIMSK2_reg_t) == 1, "invalid size of ATmega2560 TIMSK2_reg_t");

struct TIMSK3_reg_t {
  uint8_t _TOIE3 : 1;
  uint8_t _OCIE3A : 1;
  uint8_t _OCIE3B : 1;
  uint8_t _OCIE3C : 1;
  uint8_t reserved1 : 1;
  uint8_t _ICIE3 : 1;
  uint8_t reserved2 : 2;
};
static_assert(sizeof(TIMSK3_reg_t) == 1, "invalid size of ATmega2560 TIMSK3_reg_t");

struct TIMSK4_reg_t {
  uint8_t _TOIE4 : 1;
  uint8_t _OCIE4A : 1;
  uint8_t _OCIE4B : 1;
  uint8_t _OCIE4C : 1;
  uint8_t reserved1 : 1;
  uint8_t _ICIE4 : 1;
  uint8_t reserved2 : 2;
};
static_assert(sizeof(TIMSK4_reg_t) == 1, "invalid size of ATmega2560 TIMSK4_reg_t");

struct TIMSK5_reg_t {
  uint8_t _TOIE5 : 1;
  uint8_t _OCIE5A : 1;
  uint8_t _OCIE5B : 1;
  uint8_t _OCIE5C : 1;
  uint8_t reserved1 : 1;
  uint8_t _ICIE5 : 1;
  uint8_t reserved2 : 2;
};
static_assert(sizeof(TIMSK5_reg_t) == 1, "invalid size of ATmega2560 TIMSK5_reg_t");

struct XMCRA_reg_t {
  uint8_t _SRW0 : 2;
  uint8_t _SRW1 : 2;
  uint8_t _SRL : 3;
  uint8_t _SRE : 1;
};
static_assert(sizeof(XMCRA_reg_t) == 1, "invalid size of ATmega2560 XMCRA_reg_t");

struct XMCRB_reg_t {
  uint8_t _XMM : 3;
  uint8_t reserved1 : 4;
  uint8_t _XMBK : 1;
};
static_assert(sizeof(XMCRB_reg_t) == 1, "invalid size of ATmega2560 XMCRB_reg_t");

struct ADCSRA_reg_t {
  uint8_t _ADPS : 3;
  uint8_t _ADIE : 1;
  uint8_t _ADIF : 1;
  uint8_t _ADATE : 1;
  uint8_t _ADSC : 1;
  uint8_t _ADEN : 1;
};
static_assert(sizeof(ADCSRA_reg_t) == 1, "invalid size of ATmega2560 ADCSRA_reg_t");

struct ADCSRB_reg_t {
  uint8_t _ADTS : 3;
  uint8_t _MUX5 : 1;
  uint8_t reserved1 : 2;
  uint8_t _ACME : 1;
  uint8_t reserved2 : 1;
};
static_assert(sizeof(ADCSRB_reg_t) == 1, "invalid size of ATmega2560 ADCSRB_reg_t");

struct ADMUX_reg_t {
  uint8_t _MUX0 : 1;
  uint8_t _MUX1 : 1;
  uint8_t _MUX2 : 1;
  uint8_t _MUX3 : 1;
  uint8_t _MUX4 : 1;
  uint8_t _ADLAR : 1;
  uint8_t _REFS0 : 1;
  uint8_t _REFS1 : 1;
};
static_assert(sizeof(ADMUX_reg_t) == 1, "invalid size of ATmega2560 ADMUX_reg_t");

struct DIDR2_reg_t {
  uint8_t _ADC8D : 1;
  uint8_t _ADC9D : 1;
  uint8_t _ADC10D : 1;
  uint8_t _ADC11D : 1;
  uint8_t _ADC12D : 1;
  uint8_t _ADC13D : 1;
  uint8_t _ADC14D : 1;
  uint8_t _ADC15D : 1;
};
static_assert(sizeof(DIDR2_reg_t) == 1, "invalid size of ATmega2560 DIDR2_reg_t");

struct DIDR0_reg_t {
  uint8_t _ADC0D : 1;
  uint8_t _ADC1D : 1;
  uint8_t _ADC2D : 1;
  uint8_t _ADC3D : 1;
  uint8_t _ADC4D : 1;
  uint8_t _ADC5D : 1;
  uint8_t _ADC6D : 1;
  uint8_t _ADC7D : 1;
};
static_assert(sizeof(DIDR0_reg_t) == 1, "invalid size of ATmega2560 DIDR0_reg_t");

struct DIDR1_reg_t {
  uint8_t _AIN0D : 1;
  uint8_t _AIN1D : 1;
  uint8_t reserved1 : 6;
};
static_assert(sizeof(DIDR1_reg_t) == 1, "invalid size of ATmega2560 DIDR1_reg_t");

struct TCCRnA_reg_t {
  uint8_t _WGMn0 : 1;
  uint8_t _WGMn1 : 1;
  uint8_t _COMnC : 2;
  uint8_t _COMnB : 2;
  uint8_t _COMnA : 2;
};
static_assert(sizeof(TCCRnA_reg_t) == 1, "invalid size of ATmega2560 TCCRnA_reg_t");

struct TCCRnB_reg_t {
  uint8_t _CSn : 3;
  uint8_t _WGMn2 : 1;
  uint8_t _WGMn3 : 1;
  uint8_t reserved1 : 1;
  uint8_t _ICESn : 1;
  uint8_t _ICNCn : 1;
};
static_assert(sizeof(TCCRnB_reg_t) == 1, "invalid size of ATmega2560 TCCRnB_reg_t");

struct TCCRnC_reg_t {
  uint8_t reserved1 : 5;
  uint8_t _FOCnC : 1;
  uint8_t _FOCnB : 1;
  uint8_t _FOCnA : 1;
};
static_assert(sizeof(TCCRnC_reg_t) == 1, "invalid size of ATmega2560 TCCRnC_reg_t");

struct TIMER_dev_t {
  TCCRnA_reg_t _TCCRnA;
  TCCRnB_reg_t _TCCRnB;
  TCCRnC_reg_t _TCCRnC;
  uint8_t reserved1;
  uint16_t _TCNTn;
  uint16_t _ICRn;
  uint16_t _OCRnA;
  uint16_t _OCRnB;
  uint16_t _OCRnC;
};
static_assert(sizeof(TIMER_dev_t) == 14, "invalid size of ATmega2560 TIMER_dev_t");

struct TCCR2A_reg_t {
  uint8_t _WGM20 : 1;
  uint8_t _WGM21 : 1;
  uint8_t reserved1 : 2;
  uint8_t _COM2B : 2;
  uint8_t _COM2A : 2;
};
static_assert(sizeof(TCCR2A_reg_t) == 1, "invalid size of ATmega2560 TCCR2A_reg_t");

struct TCCR2B_reg_t {
  uint8_t _CS2 : 3;
  uint8_t _WGM22 : 1;
  uint8_t reserved1 : 2;
  uint8_t _FOC2B : 1;
  uint8_t _FOC2A : 1;
};
static_assert(sizeof(TCCR2B_reg_t) == 1, "invalid size of ATmega2560 TCCR2B_reg_t");

struct TIMER2_dev_t {
  TCCR2A_reg_t _TCCR2A;
  TCCR2B_reg_t _TCCR2B;
  uint8_t _TCNT2;
  uint8_t _OCR2A;
  uint8_t _OCR2B;
};
static_assert(sizeof(TIMER2_dev_t) == 5, "invalid size of ATmega2560 TIMER2_dev_t");

struct ASSR_reg_t {
  uint8_t _TCR2BUB : 1;
  uint8_t _TCR2AUB : 1;
  uint8_t _OCR2BUB : 1;
  uint8_t _OCR2AUB : 1;
  uint8_t _TCN2UB : 1;
  uint8_t _AS2 : 1;
  uint8_t _EXCLK : 1;
  uint8_t reserved1 : 1;
};
static_assert(sizeof(ASSR_reg_t) == 1, "invalid size of ATmega2560 ASSR_reg_t");

struct TWSR_reg_t {
  uint8_t _TWPS0 : 1;
  uint8_t _TWPS1 : 1;
  uint8_t reserved1 : 1;
  uint8_t _TWS3 : 1;
  uint8_t _TWS4 : 1;
  uint8_t _TWS5 : 1;
  uint8_t _TWS6 : 1;
  uint8_t _TWS7 : 1;
};
static_assert(sizeof(TWSR_reg_t) == 1, "invalid size of ATmega2560 TWSR_reg_t");

struct TWAR_reg_t {
  uint8_t _TWGCE : 1;
  uint8_t _TWA : 7;
};
static_assert(sizeof(TWAR_reg_t) == 1, "invalid size of ATmega2560 TWAR_reg_t");

struct TWCR_reg_t {
  uint8_t _TWIE : 1;
  uint8_t reserved1 : 1;
  uint8_t _TWEN : 1;
  uint8_t _TWWC : 1;
  uint8_t _TWSTO : 1;
  uint8_t _TWSTA : 1;
  uint8_t _TWEA : 1;
  uint8_t _TWINT : 1;
};
static_assert(sizeof(TWCR_reg_t) == 1, "invalid size of ATmega2560 TWCR_reg_t");

struct TWAMR_reg_t {
  uint8_t reserved1 : 1;
  uint8_t _TWAM : 7;
};
static_assert(sizeof(TWAMR_reg_t) == 1, "invalid size of ATmega2560 TWAMR_reg_t");

struct UBRRn_reg_t {
  uint16_t _UBRR : 12;
  uint16_t reserved1 : 4;
}; 
static_assert(sizeof(UBRRn_reg_t) == 2, "invalid size of ATmega2560 UBRRn_reg_t)");

struct UCSRnC_reg_t {
  uint8_t _UCPOL : 1;
  uint8_t _UCSZn0 : 1;
  uint8_t _UCSZn1 : 1;
  uint8_t _USBS : 1;
  uint8_t _UPM : 2;
  uint8_t _UMSEL : 2; 
};
static_assert(sizeof(UCSRnC_reg_t) == 1, "invalid size of ATmega2560 UCSRnC_reg_t");

struct UCSRnB_reg_t {
  uint8_t _TXB8 : 1;
  uint8_t _RXB8 : 1;
  uint8_t _UCSZn2 : 1;
  uint8_t _TXEN : 1;
  uint8_t _RXEN : 1;
  uint8_t _UDRIE : 1;
  uint8_t _TXCIE : 1;
  uint8_t _RXCIE : 1;
};
static_assert(sizeof(UCSRnB_reg_t) == 1, "invalid size of ATmega2560 UCSRnB_reg_t");

struct UCSRnA_reg_t {
  uint8_t _MPCM : 1;
  uint8_t _U2X : 1;
  uint8_t _UPE : 1;
  uint8_t _DOR : 1;
  uint8_t _FE : 1;
  uint8_t _UDRE : 1;
  uint8_t _TXC : 1;
  uint8_t _RXC : 1;
};
static_assert(sizeof(UCSRnA_reg_t) == 1, "invalid size of ATmega2560 UCSRnA_reg_t");

struct USART_dev_t {
  UCSRnA_reg_t _UCSRnA;
  UCSRnB_reg_t _UCSRnB;
  UCSRnC_reg_t _UCSRnC;
  uint8_t reserved1;
  UBRRn_reg_t _UBRRn;
  uint8_t _UDRn;
};
static_assert(sizeof(USART_dev_t) == 7, "invalid size of ATmega2560 USART_dev_t");

// page 399ff of ATmega640-1280-1281-2560-2561-Datasheet-DS40002211A.pdf
static PORT_dev_t& _PORTA = *(PORT_dev_t*)0x20;
static PORT_dev_t& _PORTB = *(PORT_dev_t*)0x23;
static PORT_dev_t& _PORTC = *(PORT_dev_t*)0x26;
static PORT_dev_t& _PORTD = *(PORT_dev_t*)0x29;
static PORT_dev_t& _PORTE = *(PORT_dev_t*)0x2C;
static PORT_dev_t& _PORTF = *(PORT_dev_t*)0x2F;
static PORTG_dev_t& _PORTG = *(PORTG_dev_t*)0x32;
static PORT_dev_t& _PORTH = *(PORT_dev_t*)0x100;
static PORT_dev_t& _PORTJ = *(PORT_dev_t*)0x103;
static PORT_dev_t& _PORTK = *(PORT_dev_t*)0x106;
static PORT_dev_t& _PORTL = *(PORT_dev_t*)0x109;
static TIFR0_reg_t& _TIFR0 = *(TIFR0_reg_t*)0x35;
static TIFR1_reg_t& _TIFR1 = *(TIFR1_reg_t*)0x36;
static TIFR2_reg_t& _TIFR2 = *(TIFR2_reg_t*)0x37;
static TIFR3_reg_t& _TIFR3 = *(TIFR3_reg_t*)0x38;
static TIFR4_reg_t& _TIFR4 = *(TIFR4_reg_t*)0x39;
static TIFR5_reg_t& _TIFR5 = *(TIFR5_reg_t*)0x3A;
